Autodesk.Revit.DB.BuiltInFailures.TagFailures.RemoveTagWithNoLeaders
The Tag was deleted because it was no longer pointing to any elements.

Autodesk.Revit.DB.BuiltInFailures.TagFailures.CannotRemapTagReference
The tag reference was not remapped.

Autodesk.Revit.DB.BuiltInFailures.TagFailures.CannotPasteAssociate
Can't find new associated element. Element won't be copied.